theatrus/ksdk/platform/CMSIS/Include/device/MK24F12/MK24F12_registers.h
/*******************************************************************************
 * HW_CAN_RXIMRn - Rx Individual Mask Registers
 ******************************************************************************/

/*!
 * @brief HW_CAN_RXIMRn - Rx Individual Mask Registers (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers are located in RAM. RXIMR are used as acceptance masks for ID
 * filtering in Rx MBs and the Rx FIFO. If the Rx FIFO is not enabled, one mask
 * register is provided for each available Mailbox, providing ID masking
 * capability on a per Mailbox basis. When the Rx FIFO is enabled (MCR[RFEN] bit is
 * asserted), up to 32 Rx Individual Mask Registers can apply to the Rx FIFO ID Filter
 * Table elements on a one-to-one correspondence depending on the setting of
 * CTRL2[RFFN]. RXIMR can only be written by the CPU while the module is in Freeze
 * mode; otherwise, they are blocked by hardware. The Individual Rx Mask Registers
 * are not affected by reset and must be explicitly initialized prior to any
 * reception.
 */
typedef union _hw_can_rximrn
{
    uint32_t U;
    struct _hw_can_rximrn_bitfields
    {
        uint32_t MI : 32;              /*!< [31:0] Individual Mask Bits */
    } B;
} hw_can_rximrn_t;

/*!
 * @name Constants and macros for entire CAN_RXIMRn register
 */
/*@{*/
#define HW_CAN_RXIMRn_COUNT (16U)

#define HW_CAN_RXIMRn_ADDR(x, n) ((uint32_t)(x) + 0x880U + (0x4U * (n)))

#define HW_CAN_RXIMRn(x, n)      (*(__IO hw_can_rximrn_t *) HW_CAN_RXIMRn_ADDR(x, n))
#define HW_CAN_RXIMRn_RD(x, n)   (HW_CAN_RXIMRn(x, n).U)
#define HW_CAN_RXIMRn_WR(x, n, v) (HW_CAN_RXIMRn(x, n).U = (v))
#define HW_CAN_RXIMRn_SET(x, n, v) (HW_CAN_RXIMRn_WR(x, n, HW_CAN_RXIMRn_RD(x, n) |  (v)))
#define HW_CAN_RXIMRn_CLR(x, n, v) (HW_CAN_RXIMRn_WR(x, n, HW_CAN_RXIMRn_RD(x, n) & ~(v)))
#define HW_CAN_RXIMRn_TOG(x, n, v) (HW_CAN_RXIMRn_WR(x, n, HW_CAN_RXIMRn_RD(x, n) ^  (v)))
/*@}*/

/*
 * Constants & macros for individual CAN_RXIMRn bitfields
 */

/*!
 * @name Register CAN_RXIMRn, field MI[31:0] (RW)
 *
 * Each Individual Mask Bit masks the corresponding bit in both the Mailbox
 * filter and Rx FIFO ID Filter Table element in distinct ways. For Mailbox filters,
 * see the RXMGMASK register description. For Rx FIFO ID Filter Table elements,
 * see the RXFGMASK register description.
 *
 * Values:
 * - 0 - The corresponding bit in the filter is "don't care."
 * - 1 - The corresponding bit in the filter is checked.
 */
/*@{*/
#define BP_CAN_RXIMRn_MI     (0U)          /*!< Bit position for CAN_RXIMRn_MI. */
#define BM_CAN_RXIMRn_MI     (0xFFFFFFFFU) /*!< Bit mask for CAN_RXIMRn_MI. */
#define BS_CAN_RXIMRn_MI     (32U)         /*!< Bit field size in bits for CAN_RXIMRn_MI. */

/*! @brief Read current value of the CAN_RXIMRn_MI field. */
#define BR_CAN_RXIMRn_MI(x, n) (HW_CAN_RXIMRn(x, n).U)

/*! @brief Format value for bitfield CAN_RXIMRn_MI. */
#define BF_CAN_RXIMRn_MI(v)  ((uint32_t)((uint32_t)(v) << BP_CAN_RXIMRn_MI) & BM_CAN_RXIMRn_MI)

/*! @brief Set the MI field to a new value. */
#define BW_CAN_RXIMRn_MI(x, n, v) (HW_CAN_RXIMRn_WR(x, n, v))
/*@}*/

/*******************************************************************************
 * hw_can_t - module struct
 ******************************************************************************/
/*!
 * @brief All CAN module registers.
 */
#pragma pack(1)
typedef struct _hw_can
{
    __IO hw_can_mcr_t MCR;                 /*!< [0x0] Module Configuration Register */
    __IO hw_can_ctrl1_t CTRL1;             /*!< [0x4] Control 1 register */
    __IO hw_can_timer_t TIMER;             /*!< [0x8] Free Running Timer */
    uint8_t _reserved0[4];
    __IO hw_can_rxmgmask_t RXMGMASK;       /*!< [0x10] Rx Mailboxes Global Mask Register */
    __IO hw_can_rx14mask_t RX14MASK;       /*!< [0x14] Rx 14 Mask register */
    __IO hw_can_rx15mask_t RX15MASK;       /*!< [0x18] Rx 15 Mask register */
    __IO hw_can_ecr_t ECR;                 /*!< [0x1C] Error Counter */
    __IO hw_can_esr1_t ESR1;               /*!< [0x20] Error and Status 1 register */
    uint8_t _reserved1[4];
    __IO hw_can_imask1_t IMASK1;           /*!< [0x28] Interrupt Masks 1 register */
    uint8_t _reserved2[4];
    __IO hw_can_iflag1_t IFLAG1;           /*!< [0x30] Interrupt Flags 1 register */
    __IO hw_can_ctrl2_t CTRL2;             /*!< [0x34] Control 2 register */
    __I hw_can_esr2_t ESR2;                /*!< [0x38] Error and Status 2 register */
    uint8_t _reserved3[8];
    __I hw_can_crcr_t CRCR;                /*!< [0x44] CRC Register */
    __IO hw_can_rxfgmask_t RXFGMASK;       /*!< [0x48] Rx FIFO Global Mask register */
    __I hw_can_rxfir_t RXFIR;              /*!< [0x4C] Rx FIFO Information Register */
    uint8_t _reserved4[48];
    struct {
        __IO hw_can_csn_t CSn;             /*!< [0x80] Message Buffer 0 CS Register */
        __IO hw_can_idn_t IDn;             /*!< [0x84] Message Buffer 0 ID Register */
        __IO hw_can_word0n_t WORD0n;       /*!< [0x88] Message Buffer 0 WORD0 Register */
        __IO hw_can_word1n_t WORD1n;       /*!< [0x8C] Message Buffer 0 WORD1 Register */
    } MB[16];
    uint8_t _reserved5[1792];
    __IO hw_can_rximrn_t RXIMRn[16];       /*!< [0x880] Rx Individual Mask Registers */
} hw_can_t;
#pragma pack()

/*! @brief Macro to access all CAN registers. */
/*! @param x CAN module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_CAN_REGS(CAN0_BASE)</code>. */
#define HW_CAN_REGS(x) (*(hw_can_t *)(x))

/*
 * MK24F12 CAU
 *
 * Memory Mapped Cryptographic Acceleration Unit (MMCAU)
 *
 * Registers defined in this header file:
 * - HW_CAU_DIRECT0 - Direct access register 0
 * - HW_CAU_DIRECT1 - Direct access register 1
 * - HW_CAU_DIRECT2 - Direct access register 2
 * - HW_CAU_DIRECT3 - Direct access register 3
 * - HW_CAU_DIRECT4 - Direct access register 4
 * - HW_CAU_DIRECT5 - Direct access register 5
 * - HW_CAU_DIRECT6 - Direct access register 6
 * - HW_CAU_DIRECT7 - Direct access register 7
 * - HW_CAU_DIRECT8 - Direct access register 8
 * - HW_CAU_DIRECT9 - Direct access register 9
 * - HW_CAU_DIRECT10 - Direct access register 10
 * - HW_CAU_DIRECT11 - Direct access register 11
 * - HW_CAU_DIRECT12 - Direct access register 12
 * - HW_CAU_DIRECT13 - Direct access register 13
 * - HW_CAU_DIRECT14 - Direct access register 14
 * - HW_CAU_DIRECT15 - Direct access register 15
 * - HW_CAU_LDR_CASR - Status register  - Load Register command
 * - HW_CAU_LDR_CAA - Accumulator register - Load Register command
 * - HW_CAU_LDR_CA0 - General Purpose Register 0 - Load Register command
 * - HW_CAU_LDR_CA1 - General Purpose Register 1 - Load Register command
 * - HW_CAU_LDR_CA2 - General Purpose Register 2 - Load Register command
 * - HW_CAU_LDR_CA3 - General Purpose Register 3 - Load Register command
 * - HW_CAU_LDR_CA4 - General Purpose Register 4 - Load Register command
 * - HW_CAU_LDR_CA5 - General Purpose Register 5 - Load Register command
 * - HW_CAU_LDR_CA6 - General Purpose Register 6 - Load Register command
 * - HW_CAU_LDR_CA7 - General Purpose Register 7 - Load Register command
 * - HW_CAU_LDR_CA8 - General Purpose Register 8 - Load Register command
 * - HW_CAU_STR_CASR - Status register  - Store Register command
 * - HW_CAU_STR_CAA - Accumulator register - Store Register command
 * - HW_CAU_STR_CA0 - General Purpose Register 0 - Store Register command
 * - HW_CAU_STR_CA1 - General Purpose Register 1 - Store Register command
 * - HW_CAU_STR_CA2 - General Purpose Register 2 - Store Register command
 * - HW_CAU_STR_CA3 - General Purpose Register 3 - Store Register command
 * - HW_CAU_STR_CA4 - General Purpose Register 4 - Store Register command
 * - HW_CAU_STR_CA5 - General Purpose Register 5 - Store Register command
 * - HW_CAU_STR_CA6 - General Purpose Register 6 - Store Register command
 * - HW_CAU_STR_CA7 - General Purpose Register 7 - Store Register command
 * - HW_CAU_STR_CA8 - General Purpose Register 8 - Store Register command
 * - HW_CAU_ADR_CASR - Status register  - Add Register command
 * - HW_CAU_ADR_CAA - Accumulator register - Add to register command
 * - HW_CAU_ADR_CA0 - General Purpose Register 0 - Add to register command
 * - HW_CAU_ADR_CA1 - General Purpose Register 1 - Add to register command
 * - HW_CAU_ADR_CA2 - General Purpose Register 2 - Add to register command
 * - HW_CAU_ADR_CA3 - General Purpose Register 3 - Add to register command
 * - HW_CAU_ADR_CA4 - General Purpose Register 4 - Add to register command
 * - HW_CAU_ADR_CA5 - General Purpose Register 5 - Add to register command
 * - HW_CAU_ADR_CA6 - General Purpose Register 6 - Add to register command
 * - HW_CAU_ADR_CA7 - General Purpose Register 7 - Add to register command
 * - HW_CAU_ADR_CA8 - General Purpose Register 8 - Add to register command
 * - HW_CAU_RADR_CASR - Status register  - Reverse and Add to Register command
 * - HW_CAU_RADR_CAA - Accumulator register - Reverse and Add to Register command
 * - HW_CAU_RADR_CA0 - General Purpose Register 0 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA1 - General Purpose Register 1 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA2 - General Purpose Register 2 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA3 - General Purpose Register 3 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA4 - General Purpose Register 4 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA5 - General Purpose Register 5 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA6 - General Purpose Register 6 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA7 - General Purpose Register 7 - Reverse and Add to Register command
 * - HW_CAU_RADR_CA8 - General Purpose Register 8 - Reverse and Add to Register command
 * - HW_CAU_XOR_CASR - Status register  - Exclusive Or command
 * - HW_CAU_XOR_CAA - Accumulator register - Exclusive Or command
 * - HW_CAU_XOR_CA0 - General Purpose Register 0 - Exclusive Or command
 * - HW_CAU_XOR_CA1 - General Purpose Register 1 - Exclusive Or command
 * - HW_CAU_XOR_CA2 - General Purpose Register 2 - Exclusive Or command
 * - HW_CAU_XOR_CA3 - General Purpose Register 3 - Exclusive Or command
 * - HW_CAU_XOR_CA4 - General Purpose Register 4 - Exclusive Or command
 * - HW_CAU_XOR_CA5 - General Purpose Register 5 - Exclusive Or command
 * - HW_CAU_XOR_CA6 - General Purpose Register 6 - Exclusive Or command
 * - HW_CAU_XOR_CA7 - General Purpose Register 7 - Exclusive Or command
 * - HW_CAU_XOR_CA8 - General Purpose Register 8 - Exclusive Or command
 * - HW_CAU_ROTL_CASR - Status register  - Rotate Left command
 * - HW_CAU_ROTL_CAA - Accumulator register - Rotate Left command
 * - HW_CAU_ROTL_CA0 - General Purpose Register 0 - Rotate Left command
 * - HW_CAU_ROTL_CA1 - General Purpose Register 1 - Rotate Left command
 * - HW_CAU_ROTL_CA2 - General Purpose Register 2 - Rotate Left command
 * - HW_CAU_ROTL_CA3 - General Purpose Register 3 - Rotate Left command
 * - HW_CAU_ROTL_CA4 - General Purpose Register 4 - Rotate Left command
 * - HW_CAU_ROTL_CA5 - General Purpose Register 5 - Rotate Left command
 * - HW_CAU_ROTL_CA6 - General Purpose Register 6 - Rotate Left command
 * - HW_CAU_ROTL_CA7 - General Purpose Register 7 - Rotate Left command
 * - HW_CAU_ROTL_CA8 - General Purpose Register 8 - Rotate Left command
 * - HW_CAU_AESC_CASR - Status register  - AES Column Operation command
 * - HW_CAU_AESC_CAA - Accumulator register - AES Column Operation command
 * - HW_CAU_AESC_CA0 - General Purpose Register 0 - AES Column Operation command
 * - HW_CAU_AESC_CA1 - General Purpose Register 1 - AES Column Operation command
 * - HW_CAU_AESC_CA2 - General Purpose Register 2 - AES Column Operation command
 * - HW_CAU_AESC_CA3 - General Purpose Register 3 - AES Column Operation command
 * - HW_CAU_AESC_CA4 - General Purpose Register 4 - AES Column Operation command
 * - HW_CAU_AESC_CA5 - General Purpose Register 5 - AES Column Operation command
 * - HW_CAU_AESC_CA6 - General Purpose Register 6 - AES Column Operation command
 * - HW_CAU_AESC_CA7 - General Purpose Register 7 - AES Column Operation command
 * - HW_CAU_AESC_CA8 - General Purpose Register 8 - AES Column Operation command
 * - HW_CAU_AESIC_CASR - Status register  - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CAA - Accumulator register - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA0 - General Purpose Register 0 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA1 - General Purpose Register 1 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA2 - General Purpose Register 2 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA3 - General Purpose Register 3 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA4 - General Purpose Register 4 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA5 - General Purpose Register 5 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA6 - General Purpose Register 6 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA7 - General Purpose Register 7 - AES Inverse Column Operation command
 * - HW_CAU_AESIC_CA8 - General Purpose Register 8 - AES Inverse Column Operation command
 *
 * - hw_cau_t - Struct containing all module registers.
 */

#define HW_CAU_INSTANCE_COUNT (1U) /*!< Number of instances of the CAU module. */
#define HW_CAU (0U) /*!< Instance number for CAU. */

