theatrus/ksdk/platform/CMSIS/Include/device/MK24F12/MK24F12_registers.h
/*******************************************************************************
 * HW_CAU_ROTL_CA2 - General Purpose Register 2 - Rotate Left command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ROTL_CA2 - General Purpose Register 2 - Rotate Left command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_rotl_ca2
{
    uint32_t U;
    struct _hw_cau_rotl_ca2_bitfields
    {
        uint32_t CA2 : 32;             /*!< [31:0] CA2 */
    } B;
} hw_cau_rotl_ca2_t;

/*!
 * @name Constants and macros for entire CAU_ROTL_CA2 register
 */
/*@{*/
#define HW_CAU_ROTL_CA2_ADDR(x)  ((uint32_t)(x) + 0x9D0U)

#define HW_CAU_ROTL_CA2(x)       (*(__O hw_cau_rotl_ca2_t *) HW_CAU_ROTL_CA2_ADDR(x))
#define HW_CAU_ROTL_CA2_WR(x, v) (HW_CAU_ROTL_CA2(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ROTL_CA2 bitfields
 */

/*!
 * @name Register CAU_ROTL_CA2, field CA2[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ROTL_CA2_CA2  (0U)          /*!< Bit position for CAU_ROTL_CA2_CA2. */
#define BM_CAU_ROTL_CA2_CA2  (0xFFFFFFFFU) /*!< Bit mask for CAU_ROTL_CA2_CA2. */
#define BS_CAU_ROTL_CA2_CA2  (32U)         /*!< Bit field size in bits for CAU_ROTL_CA2_CA2. */

/*! @brief Format value for bitfield CAU_ROTL_CA2_CA2. */
#define BF_CAU_ROTL_CA2_CA2(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ROTL_CA2_CA2) & BM_CAU_ROTL_CA2_CA2)
/*@}*/

/*******************************************************************************
 * HW_CAU_ROTL_CA3 - General Purpose Register 3 - Rotate Left command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ROTL_CA3 - General Purpose Register 3 - Rotate Left command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_rotl_ca3
{
    uint32_t U;
    struct _hw_cau_rotl_ca3_bitfields
    {
        uint32_t CA3 : 32;             /*!< [31:0] CA3 */
    } B;
} hw_cau_rotl_ca3_t;

/*!
 * @name Constants and macros for entire CAU_ROTL_CA3 register
 */
/*@{*/
#define HW_CAU_ROTL_CA3_ADDR(x)  ((uint32_t)(x) + 0x9D4U)

#define HW_CAU_ROTL_CA3(x)       (*(__O hw_cau_rotl_ca3_t *) HW_CAU_ROTL_CA3_ADDR(x))
#define HW_CAU_ROTL_CA3_WR(x, v) (HW_CAU_ROTL_CA3(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ROTL_CA3 bitfields
 */

/*!
 * @name Register CAU_ROTL_CA3, field CA3[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ROTL_CA3_CA3  (0U)          /*!< Bit position for CAU_ROTL_CA3_CA3. */
#define BM_CAU_ROTL_CA3_CA3  (0xFFFFFFFFU) /*!< Bit mask for CAU_ROTL_CA3_CA3. */
#define BS_CAU_ROTL_CA3_CA3  (32U)         /*!< Bit field size in bits for CAU_ROTL_CA3_CA3. */

/*! @brief Format value for bitfield CAU_ROTL_CA3_CA3. */
#define BF_CAU_ROTL_CA3_CA3(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ROTL_CA3_CA3) & BM_CAU_ROTL_CA3_CA3)
/*@}*/

/*******************************************************************************
 * HW_CAU_ROTL_CA4 - General Purpose Register 4 - Rotate Left command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ROTL_CA4 - General Purpose Register 4 - Rotate Left command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_rotl_ca4
{
    uint32_t U;
    struct _hw_cau_rotl_ca4_bitfields
    {
        uint32_t CA4 : 32;             /*!< [31:0] CA4 */
    } B;
} hw_cau_rotl_ca4_t;

/*!
 * @name Constants and macros for entire CAU_ROTL_CA4 register
 */
/*@{*/
#define HW_CAU_ROTL_CA4_ADDR(x)  ((uint32_t)(x) + 0x9D8U)

#define HW_CAU_ROTL_CA4(x)       (*(__O hw_cau_rotl_ca4_t *) HW_CAU_ROTL_CA4_ADDR(x))
#define HW_CAU_ROTL_CA4_WR(x, v) (HW_CAU_ROTL_CA4(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ROTL_CA4 bitfields
 */

/*!
 * @name Register CAU_ROTL_CA4, field CA4[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ROTL_CA4_CA4  (0U)          /*!< Bit position for CAU_ROTL_CA4_CA4. */
#define BM_CAU_ROTL_CA4_CA4  (0xFFFFFFFFU) /*!< Bit mask for CAU_ROTL_CA4_CA4. */
#define BS_CAU_ROTL_CA4_CA4  (32U)         /*!< Bit field size in bits for CAU_ROTL_CA4_CA4. */

/*! @brief Format value for bitfield CAU_ROTL_CA4_CA4. */
#define BF_CAU_ROTL_CA4_CA4(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ROTL_CA4_CA4) & BM_CAU_ROTL_CA4_CA4)
/*@}*/

/*******************************************************************************
 * HW_CAU_ROTL_CA5 - General Purpose Register 5 - Rotate Left command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ROTL_CA5 - General Purpose Register 5 - Rotate Left command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_rotl_ca5
{
    uint32_t U;
    struct _hw_cau_rotl_ca5_bitfields
    {
        uint32_t CA5 : 32;             /*!< [31:0] CA5 */
    } B;
} hw_cau_rotl_ca5_t;

/*!
 * @name Constants and macros for entire CAU_ROTL_CA5 register
 */
/*@{*/
#define HW_CAU_ROTL_CA5_ADDR(x)  ((uint32_t)(x) + 0x9DCU)

#define HW_CAU_ROTL_CA5(x)       (*(__O hw_cau_rotl_ca5_t *) HW_CAU_ROTL_CA5_ADDR(x))
#define HW_CAU_ROTL_CA5_WR(x, v) (HW_CAU_ROTL_CA5(x).U = (v))
/*@}*/

/*
 * Constants & macros for individual CAU_ROTL_CA5 bitfields
 */

/*!
 * @name Register CAU_ROTL_CA5, field CA5[31:0] (WO)
 */
/*@{*/
#define BP_CAU_ROTL_CA5_CA5  (0U)          /*!< Bit position for CAU_ROTL_CA5_CA5. */
#define BM_CAU_ROTL_CA5_CA5  (0xFFFFFFFFU) /*!< Bit mask for CAU_ROTL_CA5_CA5. */
#define BS_CAU_ROTL_CA5_CA5  (32U)         /*!< Bit field size in bits for CAU_ROTL_CA5_CA5. */

/*! @brief Format value for bitfield CAU_ROTL_CA5_CA5. */
#define BF_CAU_ROTL_CA5_CA5(v) ((uint32_t)((uint32_t)(v) << BP_CAU_ROTL_CA5_CA5) & BM_CAU_ROTL_CA5_CA5)
/*@}*/

/*******************************************************************************
 * HW_CAU_ROTL_CA6 - General Purpose Register 6 - Rotate Left command
 ******************************************************************************/

/*!
 * @brief HW_CAU_ROTL_CA6 - General Purpose Register 6 - Rotate Left command (WO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_cau_rotl_ca6
{
    uint32_t U;
    struct _hw_cau_rotl_ca6_bitfields
    {
        uint32_t CA6 : 32;             /*!< [31:0] CA6 */
    } B;
} hw_cau_rotl_ca6_t;

/*!
 * @name Constants and macros for entire CAU_ROTL_CA6 register
 */
/*@{*/
#define HW_CAU_ROTL_CA6_ADDR(x)  ((uint32_t)(x) + 0x9E0U)

